
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяЭлемента = Неопределено;
	
	Если Параметры.Свойство("ТекущаяСтраница", ИмяЭлемента) Тогда
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы[ИмяЭлемента];
	Иначе
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.Страница1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗакрыть1Нажатие(Элемент)
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаЗакрыть2Нажатие(Элемент)
	
	Закрыть();
	
КонецПроцедуры
