
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если Параметры.Отбор.Свойство("ДокументПривязки") Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	усОстаткиТоваровОстатки.КлючАналитикиУчетаНоменклатуры.Номенклатура КАК Ссылка
					   |ИЗ
		               |	РегистрНакопления.усОстаткиТоваров.Остатки КАК усОстаткиТоваровОстатки
		               |ГДЕ
		               |	усОстаткиТоваровОстатки.Контейнер.ДокументПривязки = &ДокументПривязки";
		Запрос.УстановитьПараметр("ДокументПривязки", Параметры.Отбор.ДокументПривязки);
		Таблица = Запрос.Выполнить().Выгрузить();
		Параметры.Отбор.Вставить("Ссылка", Таблица.ВыгрузитьКолонку("Ссылка"));
		Параметры.Отбор.Удалить("ДокументПривязки");
		Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли;
	
КонецПроцедуры
